

WebDKP_Log = {
	["测试1 2025-12-21 10:24:03"] = {
		["awarded"] = {
			["先跑为敬"] = true,
			["缺德不呀"] = true,
		},
		["zone"] = "暴风城",
		["date"] = "2025-12-21 10:24:03",
		["reason"] = "测试1",
		["foritem"] = false,
		["uniqueId"] = "测试1 2025-12-21 10:24:03",
		["points"] = 1,
		["awardedby"] = "先跑为敬",
		["tableid"] = 6,
	},
	["Version"] = 2,
	["测试3 2025-12-21 10:29:03"] = {
		["awarded"] = {
			["先跑为敬"] = {
				["name"] = "先跑为敬",
				["class"] = "战士",
				["guild"] = "无忧小筑",
			},
			["缺德不呀"] = {
				["class"] = "德鲁伊",
				["name"] = "缺德不呀",
			},
		},
		["zone"] = "暴风城",
		["date"] = "2025-12-21 10:29:03",
		["reason"] = "测试3",
		["foritem"] = "false",
		["uniqueId"] = "测试3 2025-12-21 10:29:03",
		["points"] = 3,
		["awardedby"] = "先跑为敬",
		["tableid"] = 6,
	},
	["测试2 2025-12-21 10:24:07"] = {
		["awarded"] = {
			["先跑为敬"] = true,
			["缺德不呀"] = true,
		},
		["zone"] = "暴风城",
		["date"] = "2025-12-21 10:24:07",
		["reason"] = "测试2",
		["foritem"] = false,
		["uniqueId"] = "测试2 2025-12-21 10:24:07",
		["points"] = 1,
		["awardedby"] = "先跑为敬",
		["tableid"] = 6,
	},
}
